// 아코디언 뷰(인터뷰 질문과 답변)를를 위한 MockData
export const mockQuestions = [
  {
    "question": "크로스 브라우징 기술에 대해 더 자세히 설명해주실 수 있나요? 구체적으로 어떤 기술을 말씀하시는 것이며, 네이버 서비스에 적용했을 때 어떤 이점이 있을 것으로 예상하시는지 설명해주십시오.",
    "answer": "잘못 말했습니다. 크로스 플랫폼입니다. ios랑 android랑 동시에 구동 가능하게 하는 기술입니다. 네이버는 글로벌 기업으로 도약해야 하는 만큼 안드로이드와 ios에서 동일한 사용자 경험을 제공하기 위해 크로스플랫폼을 고려해야 할 것입니다",
    "scores": [
      3,
      2,
      3,
      3,
      3,
      4
    ],
    "feedbacks": [
      "크로스 브라우징과 크로스 플랫폼을 혼동한 점은 아쉽지만, 이후 크로스 플랫폼에 대한 기본적인 이해를 보여주었습니다.",
      "질문 의도를 정확히 파악하지 못하고 답변하여 문제 해결 능력을 평가하기 어렵습니다. 크로스 플랫폼 기술 적용에 대한 구체적인 방안 제시가 부족합니다.",
      "네이버 서비스에 크로스 플랫폼을 적용했을 때의 이점을 언급했지만, 깊이 있는 분석이나 차별화된 전략은 보이지 않습니다.",
      "코드 구현력 평가는 질문에 따라 평가가 어려움",
      "비슷한 용어에 대한 혼동이 있었지만, 이후 답변은 비교적 명확하게 전달되었습니다. 다만, 설명이 다소 추상적입니다.",
      "잘못을 빠르게 인정하고 정정하려는 태도는 긍정적입니다. 글로벌 기업으로의 도약을 언급하며 성장 의지를 간접적으로 드러냈습니다."
    ]
  },
  {
    "question": "팀 협업 과정에서 갈등이 발생했을 때, 본인이 어떤 역할을 수행하며, 어떻게 해결해나가는 편입니까? 실제 협업 경험을 바탕으로 구체적인 사례를 들어 설명해주십시오.",
    "answer": "던져요",
    "scores": [
      1,
      1,
      1,
      3,
      1,
      1
    ],
    "feedbacks": [
      "기술적인 내용에 대한 이해를 전혀 보여주지 못했습니다.",
      "문제 해결을 위한 어떠한 논리적인 접근도 제시하지 못했습니다.",
      "기초 지식을 응용하려는 시도조차 없었습니다.",
      "코드 구현력 평가는 질문에 따라 평가가 어렵습니다.",
      "질문에 대한 답변이 명확하지 않고, 적절한 설명을 제공하지 못했습니다.",
      "질문에 대한 회피적인 답변으로, 문제 해결에 대한 의지나 건설적인 태도를 보여주지 못했습니다."
    ]
  }
];